[
  {
    "name": "陳錦文",
    "email": "cwchen@mail.ntut.edu.tw",
    "latestUpdate": "2025-05-23 13:24:08",
    "objective": "本課程目的在讓學生系統性理解複合材料的基本概念與結構組成，從基體與補強材的材料選擇與功能設計，進一步掌握奈米與功能性複材、紡織增強複材及智慧穿戴應用等前瞻議題；並透過各類加工方法與未來趨勢的探討，結合理論學習與實務應用，培養學生具備分析、設計與評估複合材料系統的能力，最終能於期末簡報中展現整合所學之能力。\nThis course aims to provide students with a systematic understanding of the fundamental concepts and structural composition of composite materials. It covers the selection and functional design of matrix and reinforcement materials, and further explores advanced topics such as nanocomposites, functional composites, textile-reinforced composites, and smart wearable applications. Through the integration of various processing techniques and discussions on future trends, the course bridges theoretical knowledge with practical application. It is designed to cultivate students' abilities in analyzing, designing, and evaluating composite material systems, ultimately enabling them to demonstrate their integrated learning outcomes through a comprehensive final presentation.",
    "schedule": "W1: Introduction to Composite Materials\nW2-3: Matrix Materials\nW4-5: Reinforced Materials\nW6: Functional Composite Materials\nW7-8: Textile-reinforced Materials\nW9-10: Processing Methods of Composite Materials\nW11: Min-term Exam\nW12: Nanocomposite Materials\nW13: Smart Textiles and Wearable Composite Application\nW14: Future Trend of Composite Materials\nW15-18: Final Presentation",
    "scorePolicy": "Mid-term Exam 40%\nTopic Oral Presentation 50% \nAttend 10%",
    "materials": "Composite Materials Science and Engineering, Second Edition (ISBN 978-1-4419-3124-5)\nFundamentals of Composites Manufacturing - Materials, Methods, and Applications (Strong, A. Brent) (ISBN: 0-87263-854-5)",
    "consultation": "請同學可以寫 email: cwchen@mail.ntut.edu.tw 或校內分機 #2456 給老師進行課程諮詢",
    "課程對應SDGs指標": "SDG9：產業創新與基礎設施（Industry, Innovation and Infrastructure）SDG12：負責任的消費與生產（Responsible Consumption and Production）",
    "課程是否導入AI": "● 鼓勵學生使用生成式 AI 工具（Encourage students to use generative AI tools）",
    "remarks": "可以用 AI 工具協助期末主題式報告",
    "foreignLanguageTextbooks": true
  }
]
